{
  "2024-3-13": [
    [
      "2024-03-13 01:11PM",
      "Students allege discrimination within Penn Med master's program, prompting investigation"
    ]
  ],
  "2024-3-14": [
    [
      "2024-03-14 01:04PM",
      "Excerpts of depositions from Penn admin. offer new insight into Mackenzie Fierceton lawsuit"
    ],
    [
      "2024-03-14 01:43PM",
      "Excerpts of depositions from Penn admin. offer new insight into Mackenzie Fierceton lawsuit U.S. House committee grills special counsel on classified documents found at Penn Biden Center Students allege discrimination within Penn Med master's program, prompting investigation Michelle Lyu | We want to be free DP Daybreak | Inside Mackenzie Fierceton's lawsuit Excerpts of depositions from Penn admin. offer new insight into Mackenzie Fierceton lawsuit Penn Med researchers awarded grant to train learning health system scientists Celebrating 30 Years of Quizo at New Deck DP Daybreak | Inside Mackenzie Fierceton's lawsuit Quaker Nation | A new champ in town Submit your tip confidentially and securely to the DP Faculty group sues Penn over 'McCarthyism,' aiming to stop transfer of University documents to Congress DP Daybreak | Inside Mackenzie Fierceton's lawsuit Penn Med researchers awarded grant to train learning health system scientists Carrie Hutnick appointed new executive director of Civic House, Penn Civic Scholars Program Penn Medicine joins White House voluntary commitments on AI use in healthcare  Nine Penn affiliates selected as 2024 Thouron Scholars to study in the United Kingdom DP Daybreak | Discrimination allegations in Penn Med program Two new plaintiffs join amended lawsuit against Penn over antisemitism on campus Pulitzer Prize-winning journalists Maureen Dowd, Ashley Parker speak at Kelly Writers House Clark Slajchert of Penn men’s basketball enters transfer portal for graduate year Men’s basketball’s Clark Slajchert earns All-Ivy second team nod Three members of Penn women’s basketball take home All-Ivy awards  Penn track and field shows out at the NCAA Division I Indoor Championships Penn wrestling takes fourth at EIWA Championships Caroline Magdolen | “Everyone cheats.” What can we do about it? Michelle Lyu | We want to be free Hanadi Abdulkadir | How poor dining hall food shapes our mental and academic capabilities Mritika Senthil | Why critics are missing the mark on Penn’s artificial intelligence major  Akiva Berkowitz | An AI major by any other name  Eric Najera | Penn must take action to enhance the dining experience  "
    ],
    [
      "2024-03-14 01:55PM",
      "Excerpts of depositions from Penn admin. offer new insight into Mackenzie Fierceton lawsuit\nU.S. House committee grills special counsel on classified documents found at Penn Biden Center\nStudents allege discrimination within Penn Med master's program, prompting investigation\nMichelle Lyu | We want to be free\nDP Daybreak | Inside Mackenzie Fierceton's lawsuit\nExcerpts of depositions from Penn admin. offer new insight into Mackenzie Fierceton lawsuit\nPenn Med researchers awarded grant to train learning health system scientists\nCelebrating 30 Years of Quizo at New Deck\nDP Daybreak | Inside Mackenzie Fierceton's lawsuit\nQuaker Nation | A new champ in town\nSubmit your tip confidentially and securely to the DP\nFaculty group sues Penn over 'McCarthyism,' aiming to stop transfer of University documents to Congress\nDP Daybreak | Inside Mackenzie Fierceton's lawsuit\nPenn Med researchers awarded grant to train learning health system scientists\nCarrie Hutnick appointed new executive director of Civic House, Penn Civic Scholars Program\nPenn Medicine joins White House voluntary commitments on AI use in healthcare \nNine Penn affiliates selected as 2024 Thouron Scholars to study in the United Kingdom\nDP Daybreak | Discrimination allegations in Penn Med program\nTwo new plaintiffs join amended lawsuit against Penn over antisemitism on campus\nPulitzer Prize-winning journalists Maureen Dowd, Ashley Parker speak at Kelly Writers House\nClark Slajchert of Penn men’s basketball enters transfer portal for graduate year\nMen’s basketball’s Clark Slajchert earns All-Ivy second team nod\nThree members of Penn women’s basketball take home All-Ivy awards \nPenn track and field shows out at the NCAA Division I Indoor Championships\nPenn wrestling takes fourth at EIWA Championships\nCaroline Magdolen | “Everyone cheats.” What can we do about it?\nMichelle Lyu | We want to be free\nHanadi Abdulkadir | How poor dining hall food shapes our mental and academic capabilities\nMritika Senthil | Why critics are missing the mark on Penn’s artificial intelligence major \nAkiva Berkowitz | An AI major by any other name \nEric Najera | Penn must take action to enhance the dining experience\n\n"
    ],
    [
      "2024-03-14 02:25PM",
      "Excerpts of depositions from Penn admin. offer new insight into Mackenzie Fierceton lawsuit"
    ],
    [
      "2024-03-14 02:50PM",
      ""
    ],
    [
      "2024-03-14 03:00PM",
      "no data"
    ],
    [
      "2024-03-14 03:11PM",
      ""
    ]
  ],
  "2024-3-15": [
    [
      "2024-03-15 04:12PM",
      ""
    ]
  ],
  "2024-3-16": [
    [
      "2024-03-16 04:09PM",
      ""
    ]
  ],
  "2024-3-17": [
    [
      "2024-03-17 04:09PM",
      ""
    ]
  ],
  "2024-3-18": [
    [
      "2024-03-18 04:10PM",
      ""
    ]
  ],
  "2024-3-19": [
    [
      "2024-03-19 04:10PM",
      ""
    ]
  ],
  "2024-3-20": [
    [
      "2024-03-20 04:11PM",
      ""
    ]
  ],
  "2024-3-21": [
    [
      "2024-03-21 04:10PM",
      ""
    ]
  ],
  "2024-3-22": [
    [
      "2024-03-22 04:09PM",
      ""
    ]
  ],
  "2024-3-23": [
    [
      "2024-03-23 04:10PM",
      ""
    ]
  ],
  "2024-3-24": [
    [
      "2024-03-24 04:09PM",
      ""
    ]
  ]
}